# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

any_number = 120
print(any_number)
print(type(any_number))
any_str = 'Привет'
print(any_str, type(any_str))
variable = input('Введите значение переменной ')
print('Вы ввели: ', variable)
